Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ2051CA70064.svd
            <register>
               <name>EFTSH</name>
               <description>PTP Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0x0E8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFRSH</name>
               <description>PTP Event Frame Received Seconds High Register</description>
               <addressOffset>0x0EC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFTSH</name>
               <description>PTP Peer Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0x0F0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRSH</name>
               <description>PTP Peer Event Frame Received Seconds High Register</description>
               <addressOffset>0x0F4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTLO</name>
               <description>Octets Transmitted Low Register</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTHI</name>
               <description>Octets Transmitted High Register</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FT</name>
               <description>Frames Transmitted Register</description>
               <addressOffset>0x108</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FTX</name>
                     <description>Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCFT</name>
               <description>Broadcast Frames Transmitted Register</description>
               <addressOffset>0x10C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BFTX</name>
                     <description>Broadcast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MFT</name>
               <description>Multicast Frames Transmitted Register</description>
               <addressOffset>0x110</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFTX</name>
                     <description>Multicast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFT</name>
               <description>Pause Frames Transmitted Register</description>
               <addressOffset>0x114</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PFTX</name>
                     <description>Pause Frames Transmitted Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFT64</name>
               <description>64 Byte Frames Transmitted Register</description>
               <addressOffset>0x118</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>64 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT127</name>
               <description>65 to 127 Byte Frames Transmitted Register</description>
               <addressOffset>0x11C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>65 to 127 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT255</name>
               <description>128 to 255 Byte Frames Transmitted Register</description>
               <addressOffset>0x120</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>128 to 255 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT511</name>
               <description>256 to 511 Byte Frames Transmitted Register</description>
               <addressOffset>0x124</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>256 to 511 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT1023</name>
               <description>512 to 1023 Byte Frames Transmitted Register</description>
               <addressOffset>0x128</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>512 to 1023 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT1518</name>
               <description>1024 to 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x12C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>1024 to 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GTBFT1518</name>
               <description>Greater Than 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x130</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>Greater than 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TUR</name>
               <description>Transmit Underruns Register</description>
               <addressOffset>0x134</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXUNR</name>
                     <description>Transmit Underruns</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCF</name>
               <description>Single Collision Frames Register</description>
               <addressOffset>0x138</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SCOL</name>
                     <description>Single Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCF</name>
               <description>Multiple Collision Frames Register</description>
               <addressOffset>0x13C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MCOL</name>
                     <description>Multiple Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC</name>
               <description>Excessive Collisions Register</description>
               <addressOffset>0x140</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>XCOL</name>
                     <description>Excessive Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LC</name>
               <description>Late Collisions Register</description>
               <addressOffset>0x144</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LCOL</name>
                     <description>Late Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTF</name>
               <description>Deferred Transmission Frames Register</description>
               <addressOffset>0x148</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEFT</name>
                     <description>Deferred Transmission</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSE</name>
               <description>Carrier Sense Errors Register</description>
               <addressOffset>0x14C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CSR</name>
                     <description>Carrier Sense Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ORLO</name>
               <description>Octets Received Low Received Register</description>
               <addressOffset>0x150</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXO</name>
                     <description>Received Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ORHI</name>
               <description>Octets Received High Received Register</description>
               <addressOffset>0x154</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXO</name>
                     <description>Received Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FR</name>
               <description>Frames Received Register</description>
               <addressOffset>0x158</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FRX</name>
                     <description>Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCFR</name>
               <description>Broadcast Frames Received Register</description>
               <addressOffset>0x15C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BFRX</name>
                     <description>Broadcast Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MFR</name>
               <description>Multicast Frames Received Register</description>
               <addressOffset>0x160</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFRX</name>
                     <description>Multicast Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFR</name>
               <description>Pause Frames Received Register</description>
               <addressOffset>0x164</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PFRX</name>
                     <description>Pause Frames Received Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFR64</name>
               <description>64 Byte Frames Received Register</description>
               <addressOffset>0x168</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>64 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR127</name>
               <description>65 to 127 Byte Frames Received Register</description>
               <addressOffset>0x16C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>65 to 127 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR255</name>
               <description>128 to 255 Byte Frames Received Register</description>
               <addressOffset>0x170</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>128 to 255 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR511</name>
               <description>256 to 511 Byte Frames Received Register</description>
               <addressOffset>0x174</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>256 to 511 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR1023</name>
               <description>512 to 1023 Byte Frames Received Register</description>
               <addressOffset>0x178</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>512 to 1023 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFR1518</name>
               <description>1024 to 1518 Byte Frames Received Register</description>
               <addressOffset>0x17C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>1024 to 1518 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMXBFR</name>
               <description>1519 to Maximum Byte Frames Received Register</description>
               <addressOffset>0x180</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>1519 to Maximum Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UFR</name>
               <description>Undersize Frames Received Register</description>
               <addressOffset>0x184</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UFRX</name>
                     <description>Undersize Frames Received</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR</name>
               <description>Oversize Frames Received Register</description>
               <addressOffset>0x188</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OFRX</name>
                     <description>Oversized Frames Received</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JR</name>
               <description>Jabbers Received Register</description>
               <addressOffset>0x18C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>JRX</name>
                     <description>Jabbers Received</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCSE</name>
               <description>Frame Check Sequence Errors Register</description>
               <addressOffset>0x190</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FCKR</name>
                     <description>Frame Check Sequence Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LFFE</name>
               <description>Length Field Frame Errors Register</description>
               <addressOffset>0x194</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LFER</name>
                     <description>Length Field Frame Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
